Repository: vazhka-dolya/kataraktaCS
Catalog: kataraktaCS/Properties/Resources.*.resx
Languages: ru

source: Segment
ru: Сегмент

# m64mm_desc
source: Advanced, real-time texture editor for SM64 machinimas.
ru: Продвинутый редактор текстур в реальном времени для СМ64-машиним.

# m64mm_open
source: Open kataraktaCS
ru: Открыть kataraktaCS

# buttonCreateTemplate
source: Create Template
ru: Создать шаблон

# buttonCreateFolderSettings
source: Create Folder Settings
ru: Создать настройки

# buttonRemoveFolderSettings
source: Remove Folder Settings
ru: Удалить настройки

# buttonRemoveTemplate
source: Remove Template
ru: Удалить шаблон

# TemplateRemovalConfirm
source: Are you sure you would like to delete the selected template? This action cannot be undone.
ru: Вы уверены, что хотите удалить данный шаблон? Данное действие отменить нельзя.

# FolderSettingsRemovalConfirm
source: Are you sure you would like to delete the folder settings for this directory? This action cannot be undone.
ru: Вы уверены, что хотите удалить настройки для данной папки? Это действие нельзя отменить.

# Error_NotValidTemplate
source: An error occurred while trying to read this template file. It might not be a valid template file.
ru: Произошла ошибка во время открытия данного шаблона. Возможно, что это неверный файл шаблона.

# Error_NotValidFolderSettings
source: An error occurred while trying to read this folder settings file. It might not be a valid folder settings file.
ru: Произошла ошибка во время открытия данных настроек папки. Возможно, что это неверный файл настроек папки.

# Error_Title
source: Error
ru: Ошибка

source: New Template
ru: Новый шаблон

source: New Texture
ru: Новая текстура

# TextureRemovalConfirm
source: Are you sure you would like to remove the selected texture?
ru: Вы уверены, что хотите удалить данную текстуру?

# TemplateFilenameAlreadyExistsError
source: Another template already exists with this filename. Please pick another filename.
ru: Уже существует другой шаблон с таким названием. Пожалуйста, напишите другое название.

# Quad64SaveSelectExtension
source: .png file (*.png)|*.png
ru: .png-файл (*.png)|*.png

# Quad64SaveTitle
source: Select where you would like to save the texture
ru: Выберите, где сохранить текстуру

# Settings_InsertGameNameHere
source: Double-click here to insert name
ru: Нажмите тут дважды и введите имя

# Settings_SelectHiResPath
source: Select the “hires_texture” folder in your emulator
ru: Выберите папку «hires_texture» в Вашем эмуляторе

# TextureToolTip_Title
source: Title: “{0}”
ru: Имя: «{0}»

# TextureToolTip_Display
source: Display: {0}
ru: Отображать: {0}

# TextureToolTip_Yes
source: Yes
ru: Да

# TextureToolTip_No
source: No
ru: Нет

# TextureToolTip_RAMAddress
source: RAM address: {0}
ru: Адрес в ОЗУ: {0}

# TextureToolTip_RAMFormat
source: RAM format: {0}
ru: Формат в памяти: {0}

# TextureToolTip_TexturePackFilename
source: Texture pack filename: “{0}”
ru: Имя файла для текстур-пака: «{0}»

# TextureToolTip_AlternativeFilename
source: Alternative filename: “{0}”
ru: Альтернативное имя файла: «{0}»

# TextureToolTip_PathIsUsed
source: (Used)
ru: (используется)

# TextureToolTip_NoAlternativeFilename
source: No alternative filename
ru: Нет альтернативного имени файла

# TextureToolTip_NoTexturePackFilename
source: No texture pack filename
ru: Нет имени файла для текстур-пака

# TemplatePathDoesNotExist
source: The specified template “{0}” does not seem to exist.
ru: Указанный шаблон, «{0}», не существует.

# Error_InvalidCache
source: Invalid cache file: specified length of the texture is longer than the rest of the cache file.
ru: Неверный кэш-файл: указанный размер текстуры больше, чем оставшаяся часть кэш-файла.

# Error_CouldNotRegisterHotkey
source: Could not register a hotkey. Please make sure that you don't have the same hotkey set to multiple textures.
ru: Не удалось зарегистрировать одну из горячих клавиш. Убедитесь, что у Вас одна горячая клавиша не выставлена на сразу несколько текстур.

# Error_PathDoesNotExist
source: The specified path (“{0}”) doesn't exist.
ru: Указанный путь («{0}») не существует.

# Confirm_Title
source: Confirm
ru: Подтверждение

# ConfirmTextureBorders
source: Are you sure you would like to fix the textures' borders? This change won't be harmful, but it can't be undone, so please confirm.
ru: Вы уверены, что хотите исправить границы текстур? Это не что-то летальное, но это нельзя отменить, поэтому подтвердите.

# updates_unknown_string
source: Can't check for updates
ru: Не удалось проверить

# updates_latest_string
source: Up-to-date
ru: Последняя версия

# updates_checking_string
source: Checking…
ru: Проверяем…

# updates_unknown_elaborate
source: Could not check if you have the latest version. Possible reasons: • The add-on has no access to the internet. • You've checked for updates too frequently (can lead to temporarily exceeding GitHub's API rate limit). Would you like to open the latest release's page on GitHub in your browser?
ru: Не удалось проверить, последняя ли у Вас версия. Возможные причины: • адд-он не имеет доступа в интернет; • Вы слишком часто проверяли на обновления (может привести к временному ограничению API GitHub). Хотите открыть страницу последней версии на GitHub в Вашем браузере?

# updates_outdated_string
source: Update available!
ru: Доступно обновление!
