Repository: vazhka-dolya/kataraktaCS
Catalog: kataraktaCS/frmSettings.*.resx
Languages: ru

# buttonClose.Text
source: Close without applying
ru: Закрыть без применения

# buttonApply.Text
source: Apply
ru: Применить

# buttonApplyAndClose.Text
source: Apply and Close
ru: Применить и закрыть

# checkTreeViewSimplified.Text
source: Use a simplified version of the texture list
ru: Использовать упрощённую версию списка текстур

# checkTreeViewSimplified.ToolTip
source: If you experience issues with the normal texture list (e.g. visual artifacts or lags), then try enabling this. Explanation for nerds: The normal texture list uses a lot of custom code to look better, but it can also be laggy or unstable for some people. The simplified version doesn't use any custom code and instead plays around the limitations of WinForms.
ru: Если стандартный список текстур вызывает у Вас проблемы (например, артефакты или лаги), то попробуйте включить данную опцию. Подробное объяснение: Стандартный список текстур использует много пользовательского кода, чтобы выглядеть лучше, но из-за этого он для некоторых людей может быть лагучим или нестабильным. Упрощённая версия не использует никакого пользовательского кода и пытается уместиться в ограничения WinForms.

# checkTreeViewDisplayIcons.Text
source: Display textures' icons
ru: Отображать иконки текстур

# checkTreeViewDisplayIcons.ToolTip
source: Less lag if disabled.
ru: Меньше лага, если выключить.

# checkTreeViewDisplayCache.Text
source: Indicate if a texture is cached for RAM.
ru: Показывать, кэширована ли текстура для ОЗУ

# checkTreeViewDisplayCache.ToolTip
source: kataraktaCS automatically creates special cache files that store preprocessed texture data in order to speed up applying textures in RAM (the cache refreshes each time you apply the texture). This option shows a small indicator (floppy disk icon) next to textures that are cached for RAM.
ru: kataraktaCS автоматически сохраняет специальные кэш-файлы, хранящие в себе заранее обработанные данные текстур, чтобы ускорить применение в ОЗУ (после каждого применения кэш также обновляется). Данная опция показывает небольшой значок дискеты возле текстур, у которых был создан кэш для ОЗУ.

# checkDisplayCacheOnRight.Text
source: Display cache icon on the right (normal texture list only)
ru: Отображать иконку кэша справа (только для обычного списка текстур)

# checkDisplayCacheOnRight.ToolTip
source: Places the cache icon (from the normal, non-simplified list) on the very right of the texture in the list.
ru: Помещает иконку кэша (в стандартном, не упрощённом списке) справа в конце.

# labelHiResPath.Text
source: Hi-res texture folder path:
ru: Hi-res-папка эмулятора:

# labelHiResPath.ToolTip
source: This is the path for the folder in your emulator that stores the “hi-res” textures, which are loaded by a graphics plugin and replace the original textures in a game. This path usually looks something like: [Path to your emulator]\Plugin\GFX\hires_texture\ or [Path to your emulator]\Plugin\hires_texture\ (You can create the “hires_texture” folder yourself if you don't have one) Note that kataraktaCS will automatically try to remove the “Cache.ini” file that some graphics plugins create since this file tends to cause problems.
ru: Это путь папки в Вашем эмуляторе, которая хранит «hi-res»-текстуры, используемые графическим плагином для замены оригинальных текстур в игре. Этот путь обычно выглядит так: [Путь к Вашему эмулятору]\Plugin\GFX\hires_texture\ или [Путь к Вашему эмулятору]\Plugin\hires_texture\ (Вы можете сами создать папку «hires_texture», если её у Вас нет) Учтите, что kataraktaCS будет автоматически удалять любые «Cache.ini»-файлы, создаваемые некоторыми графическими плагинами, ибо эти файлы могут вызывать проблемы.

# labelOtherGames.Text
source: Additional games:
ru: Дополнительные игры:

# labelOtherGames.ToolTip
source: The games that will appear as additional options next to the “Apply TP” button. You can use this for ROM hacks or other games. Please note that Project64's window's title may not always show the correct internal name. The quickest way to find out a game's internal name is launching it in Project64, then going to “File” -> “ROM Info…” and looking at “ROM name,” where you will see the name that you should put here. For example, Mario Kart 64's name will be “MARIOKART64”.
ru: Игры, которые появятся в виде дополнительных опций возле кнопки «Текстур-пак». Вы можете это использовать для ROM-хаков и других игр. Учтите, что у названия окна Project64 не всегда верное внутреннее название игры. Самый быстрый способ узнать точное название игры — запустить её в Project64, зайти в «Файл» -> «Информация об игре…» и посмотреть на «Название ROM'а», где будет указано название, которое Вам нужно сюда добавить. Например, внутреннее название Марио Карт 64 — «MARIOKART64».

# labelTexturePackMainGame.Text
source: Main game's name:
ru: Название основной игры:

# labelTexturePackMainGame.ToolTip
source: The game on which the textures will be applied when clicking the “Apply TP” button. For normal, unmodified Super Mario 64, the internal name is “SUPER MARIO 64”.
ru: Игра, на которую будут применены текстуры при нажатии кнопки «Текстур-пак». Внутреннее название у обычного Супер Марио 64 — «SUPER MARIO 64».

# tabGeneral.Text
source: Settings
ru: Настройки

# groupTexturePack.Text
source: Texture packs
ru: Текстур-паки

# buttonAddGame.Text
source: Add
ru: Добавить

# buttonRemoveSelected.Text
source: Remove Selected
ru: Удалить выбранную

# groupMisc.Text
source: Miscellaneous
ru: Прочее

# groupBackgroundColor.Text
source: Texture background
ru: Фон текстур

# buttonResetBackgroundColor.Text
source: Reset to default color
ru: Сбросить на цвет по умолчанию

# checkStayOnTop.Text
source: Enable “Stay on top” on startup
ru: Включать «Всегда сверху» при запуске

# groupTreeView.Text
source: Texture list settings
ru: Настройки списка текстур

# $this.Text
source: Settings
ru: Настройки
