Repository: vazhka-dolya/kataraktaCS
Catalog: kataraktaCS/mainForm.*.resx
Languages: ru

# ToolApplyRAM.Text
source: Apply RAM
ru: ОЗУ

# ToolApplyRAM.ToolTipText
source: Apply in RAM
ru: Применить в ОЗУ

# DropDownApplyTPOther.ToolTipText
source: Apply texture pack with a different filename
ru: Применить текстур-пак с другим именем файла

# ToolApplyTP.Text
source: Apply TP
ru: Текстур-пак

# ToolApplyTP.ToolTipText
source: Apply as a texture pack
ru: Применить как текстур-пак

# ToolRefresh.Text
source: Refresh
ru: Обновить

# ToolSearchButton.Text
source: Search
ru: Поиск

# menuOpenKataraktaCSFolder.Text
source: Open kataraktaCS Folder
ru: Открыть папку kataraktaCS

# menuOpenQuad64.Text
source: Open Texture Search
ru: Открыть Поиск текстур

# menuOpenTemplateManager.Text
source: Open Template Manager
ru: Открыть Редактор шаблонов

# menuConvertTemplates.Text
source: Convert Old Templates && Folder Settings
ru: Конвертировать старые шаблоны и настройки папок

# menuConvertTemplates.ToolTipText
source: Pre-release versions of kataraktaCS had different structures for their templates and folder settings. This option will convert any found old templates and folder settings to the new structure.
ru: Пререлизные версии kataraktaCS имели другие структуры шаблонов и настроек папок. Эта опция конвертирует любые найденные старые шаблоны и настройки в новую структуру.

# menuUtilities.Text
source: Utilities
ru: Утилиты

# menuSettings.Text
source: Settings
ru: Настройки

# menuStayOnTop.Text
source: Stay on top
ru: Всегда сверху

# menuOptions.Text
source: Options
ru: Параметры

# menuAbout.Text
source: About
ru: Об адд-оне

# menuUpdates.Text
source: Checking…
ru: Проверяем…

# menuUpdatesRefresh.Text
source: Check for Updates again
ru: Перепроверить версию

# contextApplyTexture.Text
source: Apply in RAM
ru: Применить в ОЗУ

# contextHotkeyAdd.Text
source: Add Hotkey (RAM-only)
ru: Горячая клавиша (ОЗУ)

# contextHotkeyEdit.Text
source: Edit Hotkey (RAM-only)
ru: Изменить гор. клавишу (ОЗУ)

# contextHotkeyRemove.Text
source: Remove Hotkey (RAM-only)
ru: Удалить гор. клавишу (ОЗУ)

# contextRemoveBordersSelected.Text
source: For Selected Textures
ru: У выбранных текстур

# contextRemoveBordersSelectedAndSub.Text
source: For Selected Textures && Subfolders
ru: У выбранных текстур и их подпапок

# contextRemoveBorders.Text
source: Fix Texture Borders
ru: Исправить границы текстур

# contextRemoveBorders.ToolTipText
source: This option fixes incorrect borders that you may have seen some textures have, e.g. black borders around eye textures.
ru: Эта опция исправляет неправильные границы, которые Вы могли видеть у некоторых текстур, например чёрные границы у текстур глаз.

# contextCacheGenSelected.Text
source: Generate for Selected Textures
ru: Сгенерировать у выбранных текстур

# contextCacheGenSelectedAndSub.Text
source: Generate for Selected Textures && Subfolders
ru: Сгенерировать у выбранных текстур и их подпапок

# contextCacheClearSelected.Text
source: Clear from Selected Textures
ru: Очистить у выбранных текстур

# contextCacheClearSelectedAndSub.Text
source: Clear from Selected Textures && Subfolders
ru: Очистить у выбранных текстур и их подпапок

# contextCache.Text
source: Cache
ru: Кэш

# contextSwapTemplates.Text
source: Quick Swap Templates
ru: Смена шаблона

# contextShowInExplorer.Text
source: Show in Explorer
ru: Показать в Проводнике

# contextEditTemplates.Text
source: Open Template Manager
ru: Открыть Редактор шаблонов
